imports

In [3]:
import pandas as pd
import numpy as np

Creating dataset

In [4]:
data = {'Name': ["Simson", "Anna", "Peter", "Linda", "Maria", "Daniel", "Simon", "Monica"],
        'Profession':["Data Analyst", "Steward", "Refree", "Mechanic", "Pilot", "Nurse", "Police officer", "Doctor"],
        'Age':[28, 25, np.nan, 32, 55, np.nan, 59, np.nan],
        'Country':["Namibia", "South Africa", "USA", "Canada", "Nigeria", "Germany", "Germany", "Portugal"]}

df = pd.DataFrame(data)

saving dataset into a csv file

In [5]:
df.to_csv("Missing values.csv", index=False)

reading the csv

In [6]:
pd.read_csv('Missing values.csv')

     Name      Profession   Age       Country
0  Simson    Data Analyst  28.0       Namibia
1    Anna         Steward  25.0  South Africa
2   Peter          Refree   NaN           USA
3   Linda        Mechanic  32.0        Canada
4   Maria           Pilot  55.0       Nigeria
5  Daniel           Nurse   NaN       Germany
6   Simon  Police officer  59.0       Germany
7  Monica          Doctor   NaN      Portugal

This section is to check if we have any missing values in the dataset

In [7]:
df.describe()

             Age
count   5.000000
mean   39.800000
std    15.959323
min    25.000000
25%    28.000000
50%    32.000000
75%    55.000000
max    59.000000

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Profession  8 non-null      object
 2   Age         5 non-null      float64
 3   Country     8 non-null      object
dtypes: float64(1), object(3)
memory usage: 388.0+ bytes

In [9]:
df.isnull()

    Name  Profession    Age  Country
0  False       False  False    False
1  False       False  False    False
2  False       False   True    False
3  False       False  False    False
4  False       False  False    False
5  False       False   True    False
6  False       False  False    False
7  False       False   True    False

How to check if we have any null value in the dataset

In [10]:
df.isnull().values.any()

np.True_

How to count how many NULL values we have

In [11]:
df.isnull().sum().sum()

np.int64(3)

How to count how many NULL values we have per column

In [12]:
df.isnull().sum()

Name          0
Profession    0
Age           3
Country       0
dtype: int64

In [13]:
df.isnull().any(axis=1)

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7     True
dtype: bool

dealing with missing data

In [14]:
df.dropna(axis=1, how="all")
df.dropna(axis=0, how="all")

     Name      Profession   Age       Country
0  Simson    Data Analyst  28.0       Namibia
1    Anna         Steward  25.0  South Africa
2   Peter          Refree   NaN           USA
3   Linda        Mechanic  32.0        Canada
4   Maria           Pilot  55.0       Nigeria
5  Daniel           Nurse   NaN       Germany
6   Simon  Police officer  59.0       Germany
7  Monica          Doctor   NaN      Portugal

In [15]:
df.drop_duplicates()

     Name      Profession   Age       Country
0  Simson    Data Analyst  28.0       Namibia
1    Anna         Steward  25.0  South Africa
2   Peter          Refree   NaN           USA
3   Linda        Mechanic  32.0        Canada
4   Maria           Pilot  55.0       Nigeria
5  Daniel           Nurse   NaN       Germany
6   Simon  Police officer  59.0       Germany
7  Monica          Doctor   NaN      Portugal

In [16]:
df[df["Age"].notnull()]

     Name      Profession   Age       Country
0  Simson    Data Analyst  28.0       Namibia
1    Anna         Steward  25.0  South Africa
3   Linda        Mechanic  32.0        Canada
4   Maria           Pilot  55.0       Nigeria
6   Simon  Police officer  59.0       Germany

Filling NULL values

In [17]:
df.fillna(0)
df.fillna(df["Age"].median())
df.fillna(df["Age"].mean())
df.fillna(df["Age"].mode())

     Name      Profession   Age       Country
0  Simson    Data Analyst  28.0       Namibia
1    Anna         Steward  25.0  South Africa
2   Peter          Refree   NaN           USA
3   Linda        Mechanic  32.0        Canada
4   Maria           Pilot  55.0       Nigeria
5  Daniel           Nurse   NaN       Germany
6   Simon  Police officer  59.0       Germany
7  Monica          Doctor   NaN      Portugal

In [18]:
df["Age"].ffill() #fff means forward fill

0    28.0
1    25.0
2    25.0
3    32.0
4    55.0
5    55.0
6    59.0
7    59.0
Name: Age, dtype: float64

In [19]:
df["Age"].bfill() #Backward fill

0    28.0
1    25.0
2    32.0
3    32.0
4    55.0
5    59.0
6    59.0
7     NaN
Name: Age, dtype: float64

In [20]:
df["Age"].interpolate()

0    28.0
1    25.0
2    28.5
3    32.0
4    55.0
5    57.0
6    59.0
7    59.0
Name: Age, dtype: float64